Gets all the beams of the BeamSystem.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ICollection<ElementId> GetBeamIds()
  Visual Basic
Public Function GetBeamIds As ICollection(Of ElementId)
  Visual C++
public:
ICollection<ElementId^>^ GetBeamIds()
 Return Value
 The beam Ids.
 See Also
  BeamSystem Class
  Autodesk.Revit.DB Namespace